src/InformationRegisters/УдаленныеОбъекты/УдаленныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдаленныеОбъекты</name>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодУдаления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УдаленныеОбъекты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ДобавитьСсылку(Ссылка, ДополнительнаяИнформация = Неопределено) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ПериодУдаления = ТекущаяУниверсальнаяДата();
    МенеджерЗаписи.Ссылка = Ссылка;
    МенеджерЗаписи.ДополнительнаяИнформация = ДополнительнаяИнформация;
    МенеджерЗаписи.Записать(Ложь);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
